export const MESSAGE = {
    START: (username?: string) => {
        const safeUsername = username ? `, @${username}` : '';
        return `Привет${safeUsername} 👋\n\nЭто <b>Tanpin</b> — маркетплейс токенизированных игровых предметов и достижений.\n\nЗдесь ты можешь зарабатывать на своем игровом опыте, приобретать уникальные предметы из игр.\n\nУчаствуй в ежедневных розыгрышах, получай крутые призы.\n\nПриглашай друзей, так ты повысишь шансы выиграть в розыгрышах.`;
    },

    START_AUTH: 'Подключить Telegram 🔗\n\n*Нажми на кнопку ниже, чтобы войти.*\n\nПосле возвращайся в игру, твой аккаунт будет готов 🎉',

    GUIDE: '*Это Tanpin Маркетплейс 🎉*\n\nЗдесь можно покупать и продавать игровые предметы. Купил что-то — теперь это твоё, и ты всегда можешь продать другому игроку и заработать деньги!\n\n*🔗 Торговля инвентарём*\n\nДля покупок нужны Tanpin Коины. Это валюта маркетплейса. Ты тратишь коины, когда покупаешь предметы, а при продаже — получаешь коины себе на кошелёк. Круто, да?\n\n*🔗 Как купить Tanpin Коины?*\n\nКоины можно купить с помощью банковской карты или на криптобирже. Выбирай, что тебе удобнее.\n\n*🔗 Первый сезон Tanpin*\n\nВ первом сезоне все зарабатывали Tanpin Поинты. Топ-100 лидеров получили награды от Black Russia. В новом сезоне все твои Поинты стали Tanpin Билетами.\n\n*🔗 Открыт второй сезон Tanpin*\n\nКаждый билет даёт тебе шанс ежедневно выиграть крутой приз или побороться за суперприз от Tanpin и Black Russia в финале.\n\n*Всё только начинается!* 💥',

    DICE: 'Хочешь больше билетов для розыгрышей? 🎟️\n\nЗаходи в кости, играй и забирай билеты у других игроков.\n\n@tanpin_dice_bot',

    SUPPORT: 'Появилась проблема? Есть идея или вопрос?\n\nЗадать вопрос: @tanpin_market_support'

} as const;